# SurfacePerimeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SurfacePerimeter Property
ParameterTypeId Class See Also
---
"Perimeter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SurfacePerimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfacePerimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SurfacePerimeter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace